Tekla.Structures.Model.UndefinedCurveDirectionException
The UndefinedCurveDirectionException class represents an error when, cannot make inward/outward curve check.

Tekla.Structures.Model.UndefinedCurveDirectionException.#ctor
Initializes a new instance of the UndefinedCurveDirectionException class with "Cannot make inward/outward curve check" error message.